### 1) Use series method to convert the following list[‘a’,’b’,’c’,’d’]

In [1]:
import pandas as pd
s=pd.Series(['a','b','c','d'])
s

0    a
1    b
2    c
3    d
dtype: object

### 2. Given the lists which contain names of students and their scored marks you have to create data frames which club them all using pandas. student list is 
### ['praharsha' ,'mythresh', 'kowshik' ,'pranay', 'srujan' 'raju']
### and you are given a 2d matrix which contain their marks. Their marks are [[77,89,92,95], [85,94,97,76], [77,88,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]]
### and subjects list containing ['bio','phy','che', 'mat']

In [2]:
names=['praharsha' ,'mythresh', 'kowshik' ,'pranay', 'srujan','raju']
marks=[[77,89,92,95], [85,94,97,76], [77,88,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]]
subs=['bio','phy','che', 'mat']
df=pd.DataFrame(marks,index = names,columns = subs)
df

           bio  phy  che  mat
praharsha   77   89   92   95
mythresh    85   94   97   76
kowshik     77   88   99   74
pranay      90   89   92   78
srujan      83   97   80   98
raju        90   90   80   87

### 3.Add the sci , total columns to the data frame from which science is the sum of phy, che and bio and total is the sum of all subjects?

In [3]:
df['Total'] = df.sum(axis=1)
df['Sci']=df[['bio', 'phy', 'che']].sum(1)

In [4]:
df

           bio  phy  che  mat  Total  Sci
praharsha   77   89   92   95    353  258
mythresh    85   94   97   76    352  276
kowshik     77   88   99   74    338  264
pranay      90   89   92   78    349  271
srujan      83   97   80   98    358  260
raju        90   90   80   87    347  260

### 4.Display only the marks scored by praharsha and srujan?

In [5]:
print(df.loc['praharsha'],df.loc['srujan'])

bio       77
phy       89
che       92
mat       95
Total    353
Sci      258
Name: praharsha, dtype: int64 bio       83
phy       97
che       80
mat       98
Total    358
Sci      260
Name: srujan, dtype: int64

### 5. Display all the students marks who scored 90 + marks in physics?

In [6]:
df[df["phy"]>90]

          bio  phy  che  mat  Total  Sci
mythresh   85   94   97   76    352  276
srujan     83   97   80   98    358  260

In [8]:
print("Total Marks in Biology ",df['bio'].sum())

Total Marks in Biology  502

# Using Startup DataSet

In [ ]:
sup=pd.read_csv('50_Startups.csv')